app/Controllers/letteradmin.php

SELECT *
FROM `letter`
---
    public function index()
    {
        $letter = new letterModel();
        $data['letteres'] = $letter->findAll();

SELECT *
FROM `letter`
WHERE `id` = '2'
 LIMIT 1
UPDATE `letter` SET `title` = 'judul', `alamat` = 'wano', `no` = '123', `perihal` = 'undangan', `lampiran` = '1', `content` = 'gajah', `tanggal` = '16/02/2024', `pengirim` = 'udin', `nip` = '02222', `status` = 'published'
WHERE `letter`.`id` IN ('2')
---
    public function edit($id)
    {
        // ambil artikel yang akan diedit
        $letter = new letterModel();
        $data['letter'] = $letter->where('id', $id)->first();

        // lakukan validasi data artikel
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'id' => 'required',
            'title' => 'required'
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();
        // jika data vlid, maka simpan ke database
        if ($isDataValid) {
            $letter->update($id, [
                "title" => $this->request->getPost('title'),
                "alamat" => $this->request->getPost('alamat'),
                "no" => $this->request->getPost('no'),
                "perihal" => $this->request->getPost('perihal'),
                "lampiran" => $this->request->getPost('lampiran'),
                "content" => $this->request->getPost('content'),
                "tanggal" => $this->request->getPost('tanggal'),
                "pengirim" => $this->request->getPost('pengirim'),
                "nip" => $this->request->getPost('nip'),
                "status" => $this->request->getPost('status')
            ]);