app/Controllers/letter.php

    public function index()
    {
    // buat object model $letter
    $letter = new LetterModel();

    /*
     siapkan data untuk dikirim ke view dengan nama $letteres
     dan isi datanya dengan letter yang sudah terbit
    */
    $data['letteres'] = $letter->where('status', 'published')->findAll();
---
SELECT *
FROM `letter`
WHERE `status` = 'published'

    public function viewLetter($slug)
    {
        $letter = new LetterModel();
        $data['letter'] = $letter->where([
            'slug' => $slug,
            'status' => 'published'
        ])->first();
---
SELECT *
FROM `letter`
WHERE `slug` = 'd'
AND `status` = 'published'
 LIMIT 1