app/Controllers/surkomAdmin.php

    public function index()
    {
        $surkom = new surkomModel();
        $data['surkomes'] = $surkom->findAll();
---
SELECT *
FROM `surkom`

    public function preview($id)
    {
        $surkom = new surkomModel();
        $data['surkom'] = $surkom->where('id', $id)->first();
---
SELECT *
FROM `surkom`
WHERE `id` = '2'
 LIMIT 1

    public function edit($id)
    {
        // ambil artikel yang akan diedit
        $surkom = new surkomModel();
        $data['surkom'] = $surkom->where('id', $id)->first();
---
SELECT *
FROM `surkom`
WHERE `id` = '2'
 LIMIT 1