app/Controllers/surkom.php

    public function viewsurkom($slug)
    {
        $surkom = new surkomModel();
        $data['surkom'] = $surkom->where([
            'slug' => $slug,
            'status' => 'published'
        ])->first();
---
SELECT *
FROM `surkom`
WHERE `slug` = 'hfjkd'
AND `status` = 'published'
 LIMIT 1